[
{"article_link": "https://medium.com/tag/abortion", "author": "Barry Gander", "title": "Abolition and Abortion — America’s Deadly “Noble Experiment” Forecasts the End of Anti-Abortion Laws", "summary": "One hundred years ago the mightiest pressure group ever to arise in American history upended the Constitution that had governed the country for 131 years. A coalition of moralists drove a freedom-loving people to give up a private right that had been taken for granted by millions of people since…"},
{"article_link": "https://medium.com/tag/abortion", "author": "Yael Wolfe", "title": "The One Thing That Will Save This Broken World", "summary": "And it’s something we all possess… —  Like many others, I’ve been feeling despair since the reversal of Roe v. Wade. The world has felt like a dumpster fire for long enough…and now this? In the midst of a pandemic, when we have to think through every single choice we make, every person we see, every place…"},
{"article_link": "https://medium.com/tag/abortion", "author": "Sarah Terzo", "title": "Why Do People Have Third Trimester Abortions?", "summary": "A new study by a pro-choice author answers this question. —  Although few Americans support legalized abortion in the third trimester, the number seems to be increasing. A 2022 poll found 20% of respondents in support of abortion up until birth — up from only 13% in 2018. One possible reason for this increased support is the widespread misinformation about why…"},
{"article_link": "https://medium.com/tag/abortion", "author": "Fatim Hemraj", "title": "You Don’t Have to Worry About Abortion Rights if You’re Fat and Ugly", "summary": "Haven’t you heard? You’re only allowed to fight for your right to have an abortion if you’re beautiful and fit. —  According to U.S. Congressman Matt Gaetz, unattractive women need not worry about abortion rights since no one wants to impregnate them anyway. During the Turning Point USA Student Action Summit in Tampa on July 23, Matt Gaetz told young, impressionable college students that overweight women should focus more on exercising…"},
{"article_link": "https://medium.com/tag/abortion", "author": "Claudia Koomson", "title": "Cry to Mom", "summary": "A poem about abortion. —  An aborted fetus looks at her mother to be and asks:\nWhy don’t you give me a chance to love you?\nWhy don’t you give me a chance to breathe?\nNow I could never be just like you. The mother said:\nI no longer possess the innocence I once had in…"},
{"article_link": "https://medium.com/tag/abortion", "author": "Johnny Robish", "title": "Matt Gaetz Implies Pro-Choice Women Too Ugly to Get Pregnant", "summary": "The guy who pays underage hookers for sex says who can’t get laid? —  The Huffington Post reports Matt Gaetz (R-Fla) recently spoke at the ultra-conservative Turning Point USA’s Student Action Summit in Tampa, and got huge laughs and applause from the crowd when he asked “Why is it that the women with the least likelihood of getting pregnant are the ones most worried…"}
]